{
    "Name": "EmbeddedSenderWithFormCreditLoanAgreement",
    "Demo": "https:\/\/sample-app.signnow.com\/EmbeddedSenderWithFormCreditLoanAgreement",
    "Publication Readiness": "NOT READY:  1. After filling in the form, the Editor opens outside of Sample Apps window - this was not the idea, it should behave the same in all apps.  2. \"Save and Close\" button leads to a blank page that looks broken. Click Back button takes you to SN login scren, this would be very confusing experience for new users. 3. Text is prefilled incorrectly. In the form: \"Jane Doe\", in the document: \"Jane%20Doe\" 4. For this use case, we should hide the editor and show the Send Invite screen. Borrower email should be pre-filled from the form. (Scenario 4)  5. Both Send Invite and Status page open outside of Sample App window, this is incorrect - everything should be within Sample App iframe. Now this page doesn't even have Finish Demo button, no way to proceed to registration or view the code - user is stuck.  6. Status of 2nd and 3rd recipients should not show as Unknown.",
    "Landing headline": "Credit loan agreement sample app ",
    "Landing description": "Explore the embedded sending functionality of the airSlate SignNow API. Pre-fill the agreement using a web form, configure a multi-step signing, send invites, and track signing status. ",
    "steps": "Step 1: Open Form with fields: Name - text, required Email - email, not required User completes the Form and clicks the Continue button to proceed to Step 2.  Step 2. Open custom Send Invite page. 3 recipients are added. For the first recipient, the “Sender as Signer” checkbox is checked and not editable. All Recipient Emails are required. Recipient 2 Email is pre-filled from the Form > Email field. User clicks the “Send Invite” button to proceed to Step 3.  Embedded signing link is created for Recipient 1. Step 3. Open Embedded Signer session for Recipient 1. Name field is pre-filled from the Form > Name field. User fills in fields and clicks the Done button to proceed to the next step.  Invite is sent to Recipient 2 email Step 4: Open Send Status page. User can click the Refresh button to see status updates. User can click the “Finish Demo” button to proceed to the Finish page. Step 5. Open Finish page. ",
    "github php": "https:\/\/github.com\/SignNowInc\/sample-app\/tree\/main\/samples\/EmbeddedSenderWithFormCreditLoanAgreement",
    "github java": "https:\/\/github.com\/SignNowInc\/java-sample-app\/tree\/main\/src\/main\/resources\/static\/samples\/EmbeddedSenderWithFormCreditLoanAgreement"
}