{
    "Name": "EmbeddedSenderWithoutFormFile",
    "Demo": "https:\/\/sample-app.signnow.com\/EmbeddedSenderWithoutFormFile",
    "Publication Readiness": "NOT READY: 1. FOR ALL APPS: Header should be updated: let's remove \"Real Estate Transaction Platform\" for good. 2. FOR ALL APPS: \"How it works\" section should be updated - currently it has wrong text.  Let's use the same text there as for Landing Description. 3. FOR ALL APPS: Link has to be updated to have 2 options - PHP and Java. 4. \"Save and Close\" button in the Editor links opens a blank page, this is NOT ok - can this button be hidden? If not, we will need design some screen as now it looks like a bug.  5. Embedded Editor window looks very bad on small screens, it looks broken when you open it. It's a very bad first impression. We need to brainstorm how this can be addressed. OPTIONS: Force mobile web on smaller screen OR change design to remove right panel at all, and move all options to header\/footer 6. FOR ALL APPS: We need to update subscription on the account used for sample apps - now Attachment and Formula fields are paywalled. This account should be excluded from Experiments.  7. FOR ALL APPS: Lets move all the templates to some dedicated account, using Maria's personal account in SN is no ok. 8. FOR ALL APPS: We need to add some refresh icon on status page, to indicate that the status can be updated. When the document is signed, and user clicks Refresh, the status should update.  9. FOR ALL APPS: After signing,  the status is not updated automatically on the Status page. 10. FOR ALL APPS: airslatedemo@gmail.com should not be the sender, it should be some account with @signnow.com domain. 11. FOR ALL APPS: On the Demo Completed page, the text needs to be revised, current text doesn't make sense: \"You’ve signed the EmbeddedSenderWithoutFormFile demo. \" Next sentence is also not good. Text of the link \"Go to your account to create an app\" should also be updated, as the App you can create in API Dashboard has nothing to do with Sample Apps. Anastasiia Vlasenko did Ivan see the text on this page? 12. The idea was that this demo should open a file that is uploaded ad hoc (without fields), not a template. It's would be a different code I guess. --> This is a different scenario, sending Template not file. Sending file will be a separate app. ADDED as scenario 7 to the doc.  13. FOR ALL APPS: Fonts are off, need to be fixed.",
    "Landing headline": "Sales proposal sample app",
    "Landing description": "Learn how to prepare and send a sales proposal for signature within a custom application using the airSlate SignNow API. Track the status of the proposal and download the signed document. ",
    "steps": "Step 1: Open Embedded Sender > Editor. User adds Recipient(s). User adds fillable fields. User clicks the Continue button to proceed to Step 2. Step 2. Open Embedded Sender > Send Invite. Recipient Email is required. User clicks the “Send Invite” button to proceed to Step 3. Invite is sent to Recipient 1 email. Step 3: Open Send Status page. User can click the Refresh button to see status updates. User can click the “Finish Demo” button to proceed to the Finish page. Step 4. Open Finish page. ",
    "github php": "https:\/\/github.com\/SignNowInc\/sample-app\/tree\/main\/samples\/EmbeddedSenderWithoutFormFile",
    "github java": "https:\/\/github.com\/SignNowInc\/java-sample-app\/tree\/main\/src\/main\/resources\/static\/samples\/EmbeddedSenderWithoutFormFile"
}